---
kind: method
id: M:Autodesk.Revit.DB.FabricationServiceSettings.RemoveFluidSetting(Autodesk.Revit.DB.FabricationService)
source: html/7eaaddca-683d-7d6b-9191-d61e06492c38.htm
---
# Autodesk.Revit.DB.FabricationServiceSettings.RemoveFluidSetting Method

Clears the fluid setting of the specified service if found.

## Syntax (C#)
```csharp
public void RemoveFluidSetting(
	FabricationService service
)
```

## Parameters
- **service** (`Autodesk.Revit.DB.FabricationService`) - The service to clear.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null